In [1]:
import pandas as pd

In [2]:
# pandas series : A pandas series is like a one-dimensional array, which has only one column. it can hold data of any datatype

series1 = pd.Series()
print(series1)
print(type(series1))

Series([], dtype: float64)
<class 'pandas.core.series.Series'>

C:\Users\divya.gupta\AppData\Local\Temp\ipykernel_24388\210472745.py:3: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  series1 = pd.Series()

In [3]:
fruits = ['mango','banana','pineapple']
index = ['a','b','c']
series2 = pd.Series(fruits,index,name = "Fruits")
print(series2)

a        mango
b       banana
c    pineapple
Name: Fruits, dtype: object

In [4]:
dict1 = {'Name': "Virat Kohli",'Profession': "Cricketer","Nationality":"Indian"}
S = pd.Series(dict1)
print(S)

Name           Virat Kohli
Profession       Cricketer
Nationality         Indian
dtype: object

In [5]:
S.shape

(3,)

In [6]:
S.empty

False

In [7]:
S.memory_usage()

48

In [8]:
s1 = pd.Series([5,10,15,20])
s2 = pd.Series([10,20,30,40])
s3 = s2 - s1

In [9]:
s2.le(s1)

0    False
1    False
2    False
3    False
dtype: bool

In [10]:
s1.gt(s2)

0    False
1    False
2    False
3    False
dtype: bool

In [11]:
s1.equals(s2)

False

In [12]:
# PANDAS DATAFRAME : It is a tabular data structure having rows and columns 

empty_df = pd.DataFrame()
print(empty_df)

Empty DataFrame
Columns: []
Index: []

In [13]:
dict1 = {
    "Names" : ["Pravin","Shashi","Samar"],
    "Course" : ["Data Science","Data Analyst", "Python Developer"],
    "Duration" : ["7 months", "4 months", "6 months"]
}

df = pd.DataFrame(dict1)
df

    Names            Course  Duration
0  Pravin      Data Science  7 months
1  Shashi      Data Analyst  4 months
2   Samar  Python Developer  6 months

In [14]:
df.shape

(3, 3)

In [15]:
list1 = ["Pravin","Shashi","Samar"]
list2 = ["Data Science","Data Analyst", "Python Developer"]
list3 = ["7 months", "4 months", "6 months"]

list4 = [list1, list2, list3]
list4
index1 = ["Name","Course","Duration"]
col = ['a','b','c']

df2 = pd.DataFrame(list4,index = index1,columns= col)
df2

                     a             b                 c
Name            Pravin        Shashi             Samar
Course    Data Science  Data Analyst  Python Developer
Duration      7 months      4 months          6 months

In [16]:
index = ['a','b','c']
col = ['I','II','III','IV']
df3 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]], index = index, columns= col)

df3

   I  II  III  IV
a  1   2    3   4
b  5   6    7   8
c  9  10   11  12

In [17]:
x = lambda a : a**2

df3 = df3.transform(func = x, axis = 1)
df3

    I   II  III   IV
a   1    4    9   16
b  25   36   49   64
c  81  100  121  144

In [18]:
df_csv = pd.read_csv(r"emp_data.csv")
df_csv.columns
df_csv.drop('Unnamed: 0', axis = 1, inplace = True)
df_csv

  emp_Name   Designation Sub Department Department
0   Ritesh    HR Manager             HR         HR
1    Seema     Developer    Development         IT
2    Rohit  Data Analyst      Analytics  Data Team

In [19]:
emp = {
    "emp_Name" :['Deep', 'Riya','Mihika'],
    "Designation" : ['Senior Data Scientist','Program Manager','Head of Department'],
    "Sub Department" : ["Analytics", "Development","IT"],
    "Department" : ["Data", "IT", "IT"]    
       }

df5 = pd.DataFrame(emp)

df5

  emp_Name            Designation Sub Department Department
0     Deep  Senior Data Scientist      Analytics       Data
1     Riya        Program Manager    Development         IT
2   Mihika     Head of Department             IT         IT

In [20]:
pd.concat([df_csv, df5], axis = 0)

  emp_Name            Designation Sub Department Department
0   Ritesh             HR Manager             HR         HR
1    Seema              Developer    Development         IT
2    Rohit           Data Analyst      Analytics  Data Team
0     Deep  Senior Data Scientist      Analytics       Data
1     Riya        Program Manager    Development         IT
2   Mihika     Head of Department             IT         IT

In [21]:
df5.columns

Index(['emp_Name', 'Designation', 'Sub Department', 'Department'], dtype='object')

In [22]:
result = pd.merge(df_csv, df5, on = "emp_Name", how = "outer",suffixes=('df_csv','df5'))

In [23]:
result

,emp_Name,Designationdf_csv,Sub Departmentdf_csv,Departmentdf_csv,Designationdf5,Sub Departmentdf5,Departmentdf5
0,Ritesh,HR Manager,HR,HR,NaN,NaN,NaN
1,Seema,Developer,Development,IT,NaN,NaN,NaN
2,Rohit,Data Analyst,Analytics,Data Team,NaN,NaN,NaN
3,Deep,NaN,NaN,NaN,Senior Data Scientist,Analytics,Data
4,Riya,NaN,NaN,NaN,Program Manager,Development,IT
5,Mihika,NaN,NaN,NaN,Head of Department,IT,IT

In [24]:
df_csv['emp_ID'] = [1001,1002,1003]
df_csv

  emp_Name   Designation Sub Department Department  emp_ID
0   Ritesh    HR Manager             HR         HR    1001
1    Seema     Developer    Development         IT    1002
2    Rohit  Data Analyst      Analytics  Data Team    1003